wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_adc.c
    /* check the interrupt flags */
    switch(int_flag) {
    case ADC_INT_FLAG_WD0E:
        /* get the ADC analog watchdog 0 interrupt flags */
        state = ADC_STAT(adc_periph) & ADC_STAT_WD0E;
        if((0U != (ADC_CTL0(adc_periph) & ADC_CTL0_WD0EIE)) && (0U != state)) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_EORC:
        /* get the ADC end of sequence conversion interrupt flags */
        state = ADC_STAT(adc_periph) & ADC_STAT_EORC;
        if((0U != (ADC_CTL0(adc_periph) & ADC_CTL0_EORCIE)) && (0U != state)) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_EOIC:
        /* get the ADC end of inserted sequence conversion interrupt flags */
        state = ADC_STAT(adc_periph) & ADC_STAT_EOIC;
        if((0U != (ADC_CTL0(adc_periph) & ADC_CTL0_EOICIE)) && (0U != state)) {
            interrupt_flag = SET;
        }
        break;
    default:
        break;
    }
    return interrupt_flag;
}

/*!
    \brief      clear the ADC flag (API_ID(0x0023U))
    \param[in]  adc_periph: ADCx,x=0,1,2
    \param[in]  int_flag: ADC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WD0E: analog watchdog 0 event interrupt flag
      \arg        ADC_INT_FLAG_EORC: end of routine sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_EOIC: end of inserted sequence conversion interrupt flag
    \param[out] none
    \retval     none
*/
void adc_interrupt_flag_clear(uint32_t adc_periph , uint32_t int_flag)
{
    ADC_STAT(adc_periph) = ~((uint32_t)int_flag & ADC_INT_FLAG_MASK);
}
